app/views/authors/index.html.erb

SELECT "authors".* FROM "authors"
SELECT COUNT(*) FROM "authors"
---
<h1><%= pluralize(@authors.count, 'author') %></h1>