app/views/authors/show.html.erb

<h3>Posts:</h3>
<% @author.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ?  [["author_id", 4]]